# is_running = True
# while is_running:
#     answer = input("Продолжить? (y/n)")
#     if answer == 'n':
#         is_running = False
#     else:
#         print("Программа продолжает работать")


##########################################################################
# i = 1
# while i <= 10:
#     print(i)
#     i += 1


##########################################################################
# number = int(input("Введите число: "))
# i = 1
# while i < number:
#     print(i)
#     i += 1
# print("Вы достигли числа", number)


##########################################################################
# a = int(input())
# while a != 0:
#     if a < 0:
#         print('Встретилось отрицательное число', a)
#         break
#     a = int(input())
# else:
#     print('Ни одного отрицательного числа не встретилось')


##########################################################################
# while True:
#     number = int(input("Введите число: "))
#     if number > 100:
#         print("Ввели число больше ста!")
#         break
#     else:
#         print("Пожалуйста, введите число больше ста.")


##########################################################################
# a, b = 10, 11
# print(a)
# print(b)
# print(a+b)